# LegendFailures Properties

---
The BuiltInFailuresLegendFailures type exposes the following members.
| Name| Description
---|---|---
| LegendComponentBadViewType|  Legend Components may only be placed in Legends
| LegendComponentNotVisible|  The component you have selected is not visible in the selected view.
Top
#### Reference
BuiltInFailuresLegendFailures Class
Autodesk.Revit.DB Namespace